{"_path":"/characters/humans","_dir":"characters","_draft":false,"_partial":false,"_locale":"","title":"Humans","description":"An explaination of the race known as Humans.","cover":"/humans.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"hero"},"children":[{"type":"text","value":"::hero"}]},{"type":"element","tag":"h2","props":{"id":"image-humanswebp"},"children":[{"type":"text","value":"image: /humans.webp"}]},{"type":"element","tag":"h1","props":{"id":"humans"},"children":[{"type":"text","value":"Humans"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Humans are a species with low tolerance to mana and a short lifespan, but they possess an extraordinary capacity for growth, a high reproductive rate, and an insatiable curiosity for knowledge. These traits have made them a feared race among the inhabitants of Vīlībāzma. Humans are believed to be the result of one of a high god's many experiments, designed to explore the limits of a species' potential."}]},{"type":"element","tag":"h2","props":{"id":"reproduction"},"children":[{"type":"text","value":"Reproduction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Unlike other races, humans' natural weakness and low mana reserves make reproduction easier. Since they don't need mana to reproduce, humans can have as many children as their bodies can handle, which often results in large families. This trait is common among other short-lived species, allowing humans to rapidly populate and spread across the world."}]},{"type":"element","tag":"h2","props":{"id":"characteristics"},"children":[{"type":"text","value":"Characteristics"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Compared to most other races, humans are physically and magically weak:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Mana and Magic: Humans have a low tolerance to mana, making the path to becoming a mage difficult. Many humans abandon magic and instead focus on training their bodies or mastering aura manipulation for combat. The small amount of mana humans possess is often used to acquire skills that help them in physical battle."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Physical Strength: Despite their relative weakness, humans do not lose strength after giving birth, unlike some other species. Their innate power may be small, but humans compensate with physical training, adaptability, and resourcefulness."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Lifespan: Humans have a short youth compared to other races and rarely live beyond 100 years, though this is comparable to the lifespan of Orcs. However, humans age more rapidly, which limits their ability to remain strong for extended periods of time."}]}]},{"type":"element","tag":"h2","props":{"id":"evolution"},"children":[{"type":"text","value":"Evolution"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Humans have several evolutionary paths available to them:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Enlightenment: This path involves rigorous training and breaking through mental barriers to become a demi-spiritual life form. Enlightened humans gain greater tolerance for mana, enhanced physical and mental abilities, and an extended lifespan. This state allows them to partially transcend their physical body and think with their spiritual body."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Demonization: This is another path that humans can take, though it is less commonly explored in this context."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Bloodline Awakening: Certain demi-human subspecies of humans can awaken the power dormant in their bloodline, allowing them to return to a purer form of their subspecies or even transform into a fairy. However, this path is typically only available under specific circumstances.\nThe term \"Enlightened\" is used by humans to refer to those who have evolved the correct way, becoming demi-spiritual life forms. While the exact criteria for achieving Enlightenment are arbitrary, any human or demi-human who reaches this state can be considered \"Enlightened.\""}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"::"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"hero","depth":2,"text":"::hero"},{"id":"image-humanswebp","depth":2,"text":"image: /humans.webp"},{"id":"reproduction","depth":2,"text":"Reproduction"},{"id":"characteristics","depth":2,"text":"Characteristics"},{"id":"evolution","depth":2,"text":"Evolution"}]}},"_type":"markdown","_id":"content:characters:6.humans.md","_source":"content","_file":"characters/6.humans.md","_stem":"characters/6.humans","_extension":"md"}