{"_path":"/characters/orcs","_dir":"characters","_draft":false,"_partial":false,"_locale":"","title":"Orcs","description":"An explaination of the race known as Orcs.","cover":"/orcs.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"hero"},"children":[{"type":"text","value":"::hero"}]},{"type":"element","tag":"h2","props":{"id":"image-orcswebp"},"children":[{"type":"text","value":"image: /orcs.webp"}]},{"type":"element","tag":"h1","props":{"id":"orcs"},"children":[{"type":"text","value":"Orcs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Orcs are a prolific and physically powerful race, originally created by a god who saw the beauty and elegance of Elves as inefficient without physical strength to defend themselves without magic. The Orcs were initially a cultured, elegant, and highly intelligent race with great potential for magic. They were a shamanistic people, cultivating a primitive, clan-based society."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"However, their fate changed when a rival god corrupted them, degrading them into the low-intelligence, brutal, and savage creatures they are commonly perceived as today. This god, after being banished and destroyed, manipulated the Orcs into forming a bloodthirsty Horde, leading them into a relentless war against other races. The demonic corruption that accompanied this transformation also turned their once-brown skin into shades of green, filling them with an insatiable bloodlust."}]},{"type":"element","tag":"h2","props":{"id":"the-horde-and-war"},"children":[{"type":"text","value":"The Horde and War"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After conquering their home continent, the Orcish Horde sought to invade the rest of the world through the Dark Portal, launching wars against the native kingdoms. These conflicts resulted in countless deaths, with millions dying every day. Eventually, a stalemate among the races was reached, leading to the signing of a treaty and the establishment of the Vore Rovegrie Vasileio (9 great realms)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Despite their corruption, the Orcs' ancient shamanistic traditions were not completely lost. The ashes of their former culture rekindled over time, and young shamans began to emerge more frequently within their ranks, symbolizing a possible return to their original ways."}]},{"type":"element","tag":"h2","props":{"id":"appearance"},"children":[{"type":"text","value":"Appearance"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Orcs are known for their muscular physiques and impressive stature:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Males: Male Orcs typically reach around 7 feet in height and often have long and unusual facial hair."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Females: Female Orcs, while shorter, range from 6' to 6'6\" in height and tend to have eclectic hairstyles and distinctive piercings.\nOne of the most notable traits of Orcs is their acute sense of smell, which is so advanced that they can identify individuals without needing to see them."}]}]},{"type":"element","tag":"h2","props":{"id":"aging-and-growth"},"children":[{"type":"text","value":"Aging and Growth"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Orcs mature at an accelerated rate, reaching the size of a human adult by the age of six. At this age, young Orcs begin their hunter and warrior training. Orc warlocks, who were less affected by the curse that befell the race, used magic to further accelerate the growth of young Orcs, rapidly aging six-year-olds into twelve-year-olds."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"hero","depth":2,"text":"::hero"},{"id":"image-orcswebp","depth":2,"text":"image: /orcs.webp"},{"id":"the-horde-and-war","depth":2,"text":"The Horde and War"},{"id":"appearance","depth":2,"text":"Appearance"},{"id":"aging-and-growth","depth":2,"text":"Aging and Growth"}]}},"_type":"markdown","_id":"content:characters:3.orcs.md","_source":"content","_file":"characters/3.orcs.md","_stem":"characters/3.orcs","_extension":"md"}