{"generatedAt":1729976605892,"generateTime":178,"contents":[{"_path":"/","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Home","description":"An open source blog theme powered by Nuxt.","layout":"default","head":{"title":"DnD Vīlībāzma"},"body":{"type":"root","children":[{"type":"element","tag":"hero","props":{},"children":[{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h2","props":{"id":"image-continentswebp"},"children":[{"type":"text","value":"image: /continents.webp"}]},{"type":"element","tag":"template","props":{"v-slot:title":""},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Saga of Vīlībāzma"}]}]},{"type":"element","tag":"template","props":{"v-slot:description":""},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Welcome to the world of Vīlībāzma, a world once, and still, seen as the battleground of the gods, where their never-ending conflict rages on. Over time, however, the gods have shifted their approach. Instead of directly waging war, they now create various races to serve as their representatives, engaging in a long, strategic game where lives are treated as mere pawns, and pride is the ultimate stake."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"According to legend, after the great war of the gods, the world itself began to scream in agony, lashing out in endless turmoil. It is said that the seas will only calm when the world has exacted its retribution, and when all the gods have finally been vanquished."}]}]}]},{"type":"element","tag":"h2","props":{"id":"background"},"children":[{"type":"text","value":"Background"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In the early eons of the war, when the gods’ lust for blood was at its peak, they reveled in the carnage and death. Countless gods rose and fell, with few bothering to keep track of the fallen. Many who fled the battlefield were cast aside, reduced to the status of the forgotten gods, never to be seen again."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The few gods who survived the great war eventually formed a treaty, agreeing not to directly interfere with one another. As time passed, these gods—once exhilarated by the bloodshed—were left to cope with their boredom. They were the victors of that perilous era, gods who had known only war and chaos, and who had never experienced the quiet of peace."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As eons and millennia passed, the monotonous existence of the gods was disrupted by an idea from one of the minor gods—an idea that would eventually elevate this god to one of the most powerful, if not the strongest, among them. This minor god suggested shedding light on the once forsaken world and using it as a new source of entertainment. The gods would create their own races, watch them grow, influence their wars, and wound the pride of the race’s creator god in the process."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As time went on, the gods became consumed by their fascination with the mortal races. They watched as kingdoms rose and fell, as heroes emerged and faded into obscurity. Their creations lived frivolous lives, wasting their potential, much to the gods' amusement. Now, the gods—once bored—found themselves in a state of ecstasy, reveling in the despair, joy, and misery of the mortals they regarded as nothing more than ants."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Humans, alongside other races, evolved their societies to a level of coexistence. Each continent developed its own distinct voice, leading to a fragile peace. Beneath this uneasy harmony, however, lurks a darkness that some choose to ignore, while others pray they never encounter. This hidden threat, festering beneath the surface, is ready to erupt, threatening to usher in a new era of war—one that could mirror the ancient great war of the gods, which once brought the very earth to its knees. The present world is ruled by the Vore Rovegrie Vasileio, the 9 great realms that govern the continents of the world."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"image-continentswebp","depth":2,"text":"image: /continents.webp"},{"id":"background","depth":2,"text":"Background"}]}},"_type":"markdown","_id":"content:1.index.md","_source":"content","_file":"1.index.md","_stem":"1.index","_extension":"md"},{"_path":"/characters","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Characters","description":"","layout":"page","body":{"type":"root","children":[{"type":"element","tag":"articles-list","props":{"path":"characters"},"children":[]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:2.characters.md","_source":"content","_file":"2.characters.md","_stem":"2.characters","_extension":"md"},{"_path":"/continents","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Continents","description":"","layout":"page","body":{"type":"root","children":[{"type":"element","tag":"articles-list","props":{"path":"continents"},"children":[]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:3.continents.md","_source":"content","_file":"3.continents.md","_stem":"3.continents","_extension":"md"},{"_path":"/contact","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Contact","description":"","layout":"default","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"get-in-touch"},"children":[{"type":"text","value":"Get in touch"}]},{"type":"element","tag":"contact-form","props":{":fields":"[{\"type\":\"text\",\"name\":\"name\",\"label\":\"Your name\",\"required\":true},{\"type\":\"email\",\"name\":\"email\",\"label\":\"Your email\",\"required\":true},{\"type\":\"text\",\"name\":\"subject\",\"label\":\"Subject\",\"required\":false},{\"type\":\"textarea\",\"name\":\"message\",\"label\":\"Message\",\"required\":true}]"},"children":[]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:4.contact.md","_source":"content","_file":"4.contact.md","_stem":"4.contact","_extension":"md"},{"_path":"/characters/elves","_dir":"characters","_draft":false,"_partial":false,"_locale":"","title":"Elves","description":"An explaination of the race known as elves.","cover":"/elves.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"elves.webp","src":"/elves.webp"},"children":[]}]},{"type":"element","tag":"h1","props":{"id":"elves"},"children":[{"type":"text","value":"Elves"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Elves, known in their own language as Tel-quessir, are considered the fairest and wisest of the races. Alongside dragons, they were the only beings capable of coherent speech from the moment they were first created. They are a long-lived race that excels in magic, with immunity to illness and freedom from aging after reaching their prime. Elves can only be killed through violence or extreme despair. High Elves, much like dragons, are immortal and are thought to have the purest bloodline, closest to the original Elves."}]},{"type":"element","tag":"h2","props":{"id":"history-of-the-elves"},"children":[{"type":"text","value":"History of the Elves"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Elves were created by a god who valued elegance and strength above all. Their god made them immortal to prevent his creations from becoming corrupted or vulgar, and their bodies did not visually age after maturity. However, Elves could still die from physical injury or by losing the will to live after many eons. This contributed to their belief that they were superior to other races, seeing only dragons as their equals."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Elves typically come of age around fifty years old and often marry at this time. Those who marry late or never are believed to have unusual fates. Elves can discern whether another Elf is married by their eyes and voice. It is against their nature to take another’s spouse by force, as an Elf who is forcibly taken would reject life and die. Due to the union of souls when Elves marry and the eternal nature of their souls, they do not divorce or marry multiple times. Though incest is taboo, marriage among second cousins was acceptable, though the genetic dangers remain unclear."}]},{"type":"element","tag":"h2","props":{"id":"physical-attributes-and-appearance"},"children":[{"type":"text","value":"Physical Attributes and Appearance"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Elves are known for their extraordinary beauty in both face and body. There is little physical difference between males and females except for reproductive purposes. They possess far better vision and hearing than humans and have abilities that far exceed those of mankind. Many Elves are skilled in crafting seemingly magical objects."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Elves possess ethereal grace and many powers. They are light-footed, able to travel long distances without leaving tracks and can even walk lightly across snow where humans would sink. While they do require sleep, they can enter a waking meditative state to regain strength. Despite their many advantages, Elves can tire and succumb to adverse environments and hunger, requiring sustenance to survive."}]},{"type":"element","tag":"h2","props":{"id":"abilities-and-skills"},"children":[{"type":"text","value":"Abilities and Skills"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Elves have several unique abilities that set them apart from other humanoid races:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Heightened Senses: Elves are supremely aware of their surroundings, with heightened senses of sight and sound. They can see in low light conditions without difficulty."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Agility and Dexterity: Elves are agile and dexterous, allowing them to move swiftly through rough terrain. Their accuracy in attacks is unusually precise compared to other races."}]}]},{"type":"element","tag":"h2","props":{"id":"reverie-trance"},"children":[{"type":"text","value":"Reverie (Trance)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Elves do not sleep in the traditional sense but instead enter a meditative state known as reverie or \"trance.\" This state is as restful as true sleep but allows them to remain aware of their surroundings. Elves require roughly two-thirds of the time humans need to rest. Additionally, their ability to trance often makes them resistant to supernatural powers such as sleep, as they do not truly sleep in the usual manner but remain in a semi-aware state."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"history-of-the-elves","depth":2,"text":"History of the Elves"},{"id":"physical-attributes-and-appearance","depth":2,"text":"Physical Attributes and Appearance"},{"id":"abilities-and-skills","depth":2,"text":"Abilities and Skills"},{"id":"reverie-trance","depth":2,"text":"Reverie (Trance)"}]}},"_type":"markdown","_id":"content:characters:1.elves.md","_source":"content","_file":"characters/1.elves.md","_stem":"characters/1.elves","_extension":"md"},{"_path":"/characters/dark-elves","_dir":"characters","_draft":false,"_partial":false,"_locale":"","title":"Dark Elves","description":"An explaination of the race known as Dark Elves.","cover":"/dark-elves.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"hero"},"children":[{"type":"text","value":"::hero"}]},{"type":"element","tag":"h2","props":{"id":"image-dark-elveswebp"},"children":[{"type":"text","value":"image: /dark-elves.webp"}]},{"type":"element","tag":"h1","props":{"id":"dark-elves"},"children":[{"type":"text","value":"Dark Elves"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dark Elves, known as Druchii in their own tongue and sometimes referred to as Naggarothi or the Dark Ones, are one of the most ancient, powerful, and sadistic counterparts of the Elves. They were created by a god who coveted the beauty of the Elves but whose corrupting power left them tainted with pieces of his soul. This corruption placed them at odds with their benevolent Elven counterparts, leaving the Dark Elves in hatred and rivalry. Among all Elven tribes, they are considered the most deadly and are often regarded as \"reapers of the night\" due to their work as assassins and contract mercenaries."}]},{"type":"element","tag":"h2","props":{"id":"physical-appearance"},"children":[{"type":"text","value":"Physical Appearance"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dark Elves have distinct physical traits that set them apart from other Elven races:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Skin and Hair: Unlike the Drow, who have ebony skin, Dark Elves have dark brown skin and typically pale hair. It is believed that some of them may have black hair instead of the more common white."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Eyes: They are known for their malevolent eyes, which reflect their sinister nature and their belief that it is their birthright to rule the world.\nDark Elves do not possess darkvision, unlike their Drow cousins, but their other physical attributes, including their agility and combat skills, make them formidable foes."}]}]},{"type":"element","tag":"h2","props":{"id":"beliefs-and-mentality"},"children":[{"type":"text","value":"Beliefs and Mentality"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The Dark Elves view the world through a lens of malevolence, believing that it is their destiny to rule all that they survey. They see other races as inferior beings, existing only to grovel at their feet. Despite their belief in their right to conquer all lands, the Dark Elves are haunted by the knowledge that they cannot fully claim their inheritance while their hated brethren, the High Elves, still endure. This bitter rivalry defines much of their motivation and culture."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"::"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"hero","depth":2,"text":"::hero"},{"id":"image-dark-elveswebp","depth":2,"text":"image: /dark-elves.webp"},{"id":"physical-appearance","depth":2,"text":"Physical Appearance"},{"id":"beliefs-and-mentality","depth":2,"text":"Beliefs and Mentality"}]}},"_type":"markdown","_id":"content:characters:2.dark elves.md","_source":"content","_file":"characters/2.dark elves.md","_stem":"characters/2.dark elves","_extension":"md"},{"_path":"/characters/orcs","_dir":"characters","_draft":false,"_partial":false,"_locale":"","title":"Orcs","description":"An explaination of the race known as Orcs.","cover":"/orcs.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"hero"},"children":[{"type":"text","value":"::hero"}]},{"type":"element","tag":"h2","props":{"id":"image-orcswebp"},"children":[{"type":"text","value":"image: /orcs.webp"}]},{"type":"element","tag":"h1","props":{"id":"orcs"},"children":[{"type":"text","value":"Orcs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Orcs are a prolific and physically powerful race, originally created by a god who saw the beauty and elegance of Elves as inefficient without physical strength to defend themselves without magic. The Orcs were initially a cultured, elegant, and highly intelligent race with great potential for magic. They were a shamanistic people, cultivating a primitive, clan-based society."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"However, their fate changed when a rival god corrupted them, degrading them into the low-intelligence, brutal, and savage creatures they are commonly perceived as today. This god, after being banished and destroyed, manipulated the Orcs into forming a bloodthirsty Horde, leading them into a relentless war against other races. The demonic corruption that accompanied this transformation also turned their once-brown skin into shades of green, filling them with an insatiable bloodlust."}]},{"type":"element","tag":"h2","props":{"id":"the-horde-and-war"},"children":[{"type":"text","value":"The Horde and War"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After conquering their home continent, the Orcish Horde sought to invade the rest of the world through the Dark Portal, launching wars against the native kingdoms. These conflicts resulted in countless deaths, with millions dying every day. Eventually, a stalemate among the races was reached, leading to the signing of a treaty and the establishment of the Vore Rovegrie Vasileio (9 great realms)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Despite their corruption, the Orcs' ancient shamanistic traditions were not completely lost. The ashes of their former culture rekindled over time, and young shamans began to emerge more frequently within their ranks, symbolizing a possible return to their original ways."}]},{"type":"element","tag":"h2","props":{"id":"appearance"},"children":[{"type":"text","value":"Appearance"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Orcs are known for their muscular physiques and impressive stature:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Males: Male Orcs typically reach around 7 feet in height and often have long and unusual facial hair."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Females: Female Orcs, while shorter, range from 6' to 6'6\" in height and tend to have eclectic hairstyles and distinctive piercings.\nOne of the most notable traits of Orcs is their acute sense of smell, which is so advanced that they can identify individuals without needing to see them."}]}]},{"type":"element","tag":"h2","props":{"id":"aging-and-growth"},"children":[{"type":"text","value":"Aging and Growth"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Orcs mature at an accelerated rate, reaching the size of a human adult by the age of six. At this age, young Orcs begin their hunter and warrior training. Orc warlocks, who were less affected by the curse that befell the race, used magic to further accelerate the growth of young Orcs, rapidly aging six-year-olds into twelve-year-olds."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"hero","depth":2,"text":"::hero"},{"id":"image-orcswebp","depth":2,"text":"image: /orcs.webp"},{"id":"the-horde-and-war","depth":2,"text":"The Horde and War"},{"id":"appearance","depth":2,"text":"Appearance"},{"id":"aging-and-growth","depth":2,"text":"Aging and Growth"}]}},"_type":"markdown","_id":"content:characters:3.orcs.md","_source":"content","_file":"characters/3.orcs.md","_stem":"characters/3.orcs","_extension":"md"},{"_path":"/characters/dragons","_dir":"characters","_draft":false,"_partial":false,"_locale":"","title":"Dragons","description":"An explaination of the race known as Dragons.","cover":"/dragons.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"hero"},"children":[{"type":"text","value":"::hero"}]},{"type":"element","tag":"h2","props":{"id":"image-dragonswebp"},"children":[{"type":"text","value":"image: /dragons.webp"}]},{"type":"element","tag":"h1","props":{"id":"dragons"},"children":[{"type":"text","value":"Dragons"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dragons are among the most ancient, intelligent, and powerful creatures in existence. They are both feared and admired, often considered the highest-ranking beings in the world. These nigh-invulnerable and unstoppable avatars of nature serve as pillars of creation, with only five of the highest-ranking dragons known to exist."}]},{"type":"element","tag":"h2","props":{"id":"physical-traits-and-forms"},"children":[{"type":"text","value":"Physical Traits and Forms"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dragons are long-lived and immensely powerful, known for their:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Physical Strength: Dragons possess great physical power, covered in nearly impenetrable scales everywhere except their undersides.\nForm and Appearance: As spiritual beings, Dragons do not have a fixed appearance. They can assume any form or properties they desire, influenced by their self-image and individuality. Typically, they take the form of massive, lizard-like creatures with horns and scales."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Dual Forms: Dragons have two primary forms: their natural, winged dragon form, which is more durable and destructive, and a secondary human-like form that is more energy-efficient and better suited for long-term battles."}]}]},{"type":"element","tag":"h2","props":{"id":"nature-and-behavior"},"children":[{"type":"text","value":"Nature and Behavior"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dragons are avatars of nature itself, embodying cunning and subtle intelligence. Their spiritual existence allows them to detach from any physical form they take. While they are renowned for their lust for treasure and excitement, these traits are inherited from the god who created them. Dragons delight in the act of dispossession, preferring to steal treasure rather than simply finding it."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Treasure and Battle Lust: Young dragons often exhibit an insatiable thirst for battle, a trait that wanes as they mature. Their obsession with gold is unmatched, though the reasons for this are mysterious. Some theories suggest that jewels may act as primal sources of life energy for dragons, or that they have exceptionally slow metabolisms."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Rage and Destruction: Dragons, especially younger ones, are prone to fits of rage, leading to devastating effects on the land and its inhabitants."}]}]},{"type":"element","tag":"h2","props":{"id":"immortality-and-birth"},"children":[{"type":"text","value":"Immortality and Birth"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dragons, once born, can never truly die. Even if an individual Dragon is killed, another Dragon with the same natural characteristics will be born elsewhere. The newly born Dragon retains the memories of its predecessor, although it may lose some aspects of its personality. Upon rebirth, Dragons inherently understand their existence and role."}]},{"type":"element","tag":"h2","props":{"id":"abilities-and-power"},"children":[{"type":"text","value":"Abilities and Power"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dragons are the ultimate beings in every category, whether it be:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Physical Strength: Dragons' raw power is unmatched."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Mana and Magic: They have overwhelming quantities of mana and unparalleled magical abilities."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Speed and Defense: Their defenses and speed far surpass those of any other creature."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Innate Powers: Dragons' natural abilities are so superior that they do not require refined techniques. Their spiritual nature also grants them the ability to create stable material bodies by drawing mana and matter from their surroundings. This allows them to resurrect freely, without needing a vessel."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"::"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"hero","depth":2,"text":"::hero"},{"id":"image-dragonswebp","depth":2,"text":"image: /dragons.webp"},{"id":"physical-traits-and-forms","depth":2,"text":"Physical Traits and Forms"},{"id":"nature-and-behavior","depth":2,"text":"Nature and Behavior"},{"id":"immortality-and-birth","depth":2,"text":"Immortality and Birth"},{"id":"abilities-and-power","depth":2,"text":"Abilities and Power"}]}},"_type":"markdown","_id":"content:characters:4.dragons.md","_source":"content","_file":"characters/4.dragons.md","_stem":"characters/4.dragons","_extension":"md"},{"_path":"/characters/dwarves","_dir":"characters","_draft":false,"_partial":false,"_locale":"","title":"Dwarves","description":"An explaination of the race known as Dwarves.","cover":"/dwarves.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"hero"},"children":[{"type":"text","value":"::hero"}]},{"type":"element","tag":"h2","props":{"id":"image-dwarveswebp"},"children":[{"type":"text","value":"image: /dwarves.webp"}]},{"type":"element","tag":"h1","props":{"id":"dwarves"},"children":[{"type":"text","value":"Dwarves"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dwarves, known as Khazad in their own language and by other names such as Casari (their most common name), Naugrim (meaning “Stunted People”), and Gonnhirrim (“Masters of Stone”), are a resilient and tradition-bound race. They are renowned for their strong martial traditions, expert mining, and unparalleled craftsmanship."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Though some may mistakenly compare Dwarves to goblins due to their size, their intelligence, and abilities are beyond question. They are known for their serious demeanor in both battle and craftsmanship, producing high-quality goods that have earned them the respect and friendship of many races across the world. Their undefeated military history also deters others from directly opposing them."}]},{"type":"element","tag":"h2","props":{"id":"physiology"},"children":[{"type":"text","value":"Physiology"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dwarves are a proud and sturdy race, physically built to endure the dangers of their world:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Strength and Endurance: They possess great physical strength and remarkable endurance, particularly in their ability to resist extreme heat, cold, and physical burdens."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Artisanal Skills: Dwarves quickly learn new artisanal skills, especially those related to working with metal and stone.\nDwarves typically live much longer than humans, often up to 250 years. Dwarven folklore tells of their resemblance to the Seven Fathers of the Dwarves, with many believing that during times of great need, the spirits of these Fathers can return to save their people."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Height and Weight: Dwarves stand between 1.3 and 1.45 meters tall and weigh between 73 and 100 kilograms, with males being slightly taller and heavier than females."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Appearance: Dwarves have a range of skin tones, with shield dwarves having pale complexions and gold dwarves possessing tanned or brown skin. Hazel eyes are common, though blue eyes are seen among shield dwarves, and brown or green eyes are found among gold dwarves."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Longevity: Although Dwarves do not live as long as Elves or Dragons, they age more slowly than humans, reaching adulthood around age 50 and maintaining vitality well past 150 years. Most Dwarves live to see their bicentennial, and a few even surpass 400 years of age."}]}]},{"type":"element","tag":"h2","props":{"id":"craftsmanship-and-skills"},"children":[{"type":"text","value":"Craftsmanship and Skills"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dwarves are master craftsmen and smiths, taught special skills by the god Aulë, one of the Valar. Much of their time is spent crafting, smithing, and mining in their vast underground cities."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Mining: Dwarves are among the greatest miners to ever exist in Vīlībāzma, carving massive halls beneath mountains where they build their cities. They mine precious minerals such as gold, iron, copper, and silver, although they disdain coal mining as degrading."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Masonry and Smithing: Their skills as masons and smiths are unparalleled, rivaled only by the Elves in smithing and unmatched in masonry. Dwarves craft objects of great beauty from gems like diamond, emerald, ruby, and sapphire. Their creations include famed weapons, armor, and exquisite art pieces.\nDwarves are also known for their resourcefulness, able to start fires almost anywhere with minimal materials. However, they seldom farm or herd, preferring to spend their time underground, mining and crafting. They typically trade their masterfully crafted goods with Men and Elves in exchange for food and other necessities."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"::"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"hero","depth":2,"text":"::hero"},{"id":"image-dwarveswebp","depth":2,"text":"image: /dwarves.webp"},{"id":"physiology","depth":2,"text":"Physiology"},{"id":"craftsmanship-and-skills","depth":2,"text":"Craftsmanship and Skills"}]}},"_type":"markdown","_id":"content:characters:5.dwarves.md","_source":"content","_file":"characters/5.dwarves.md","_stem":"characters/5.dwarves","_extension":"md"},{"_path":"/characters/humans","_dir":"characters","_draft":false,"_partial":false,"_locale":"","title":"Humans","description":"An explaination of the race known as Humans.","cover":"/humans.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"h2","props":{"id":"hero"},"children":[{"type":"text","value":"::hero"}]},{"type":"element","tag":"h2","props":{"id":"image-humanswebp"},"children":[{"type":"text","value":"image: /humans.webp"}]},{"type":"element","tag":"h1","props":{"id":"humans"},"children":[{"type":"text","value":"Humans"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Humans are a species with low tolerance to mana and a short lifespan, but they possess an extraordinary capacity for growth, a high reproductive rate, and an insatiable curiosity for knowledge. These traits have made them a feared race among the inhabitants of Vīlībāzma. Humans are believed to be the result of one of a high god's many experiments, designed to explore the limits of a species' potential."}]},{"type":"element","tag":"h2","props":{"id":"reproduction"},"children":[{"type":"text","value":"Reproduction"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Unlike other races, humans' natural weakness and low mana reserves make reproduction easier. Since they don't need mana to reproduce, humans can have as many children as their bodies can handle, which often results in large families. This trait is common among other short-lived species, allowing humans to rapidly populate and spread across the world."}]},{"type":"element","tag":"h2","props":{"id":"characteristics"},"children":[{"type":"text","value":"Characteristics"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Compared to most other races, humans are physically and magically weak:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Mana and Magic: Humans have a low tolerance to mana, making the path to becoming a mage difficult. Many humans abandon magic and instead focus on training their bodies or mastering aura manipulation for combat. The small amount of mana humans possess is often used to acquire skills that help them in physical battle."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Physical Strength: Despite their relative weakness, humans do not lose strength after giving birth, unlike some other species. Their innate power may be small, but humans compensate with physical training, adaptability, and resourcefulness."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Lifespan: Humans have a short youth compared to other races and rarely live beyond 100 years, though this is comparable to the lifespan of Orcs. However, humans age more rapidly, which limits their ability to remain strong for extended periods of time."}]}]},{"type":"element","tag":"h2","props":{"id":"evolution"},"children":[{"type":"text","value":"Evolution"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Humans have several evolutionary paths available to them:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Enlightenment: This path involves rigorous training and breaking through mental barriers to become a demi-spiritual life form. Enlightened humans gain greater tolerance for mana, enhanced physical and mental abilities, and an extended lifespan. This state allows them to partially transcend their physical body and think with their spiritual body."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Demonization: This is another path that humans can take, though it is less commonly explored in this context."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Bloodline Awakening: Certain demi-human subspecies of humans can awaken the power dormant in their bloodline, allowing them to return to a purer form of their subspecies or even transform into a fairy. However, this path is typically only available under specific circumstances.\nThe term \"Enlightened\" is used by humans to refer to those who have evolved the correct way, becoming demi-spiritual life forms. While the exact criteria for achieving Enlightenment are arbitrary, any human or demi-human who reaches this state can be considered \"Enlightened.\""}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"::"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"hero","depth":2,"text":"::hero"},{"id":"image-humanswebp","depth":2,"text":"image: /humans.webp"},{"id":"reproduction","depth":2,"text":"Reproduction"},{"id":"characteristics","depth":2,"text":"Characteristics"},{"id":"evolution","depth":2,"text":"Evolution"}]}},"_type":"markdown","_id":"content:characters:6.humans.md","_source":"content","_file":"characters/6.humans.md","_stem":"characters/6.humans","_extension":"md"},{"_path":"/continents/oloklerious","_dir":"continents","_draft":false,"_partial":false,"_locale":"","title":"Oloklerious","description":"A brief descriptionn of the continent Oloklerius.","cover":"/oloklerious.webp","date":"2024-10-22T00:00:00.000Z","layout":"article","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"oloklerious.webp","src":"/oloklerious.webp"},"children":[]}]},{"type":"element","tag":"h1","props":{"id":"oloklerious"},"children":[{"type":"text","value":"Oloklerious"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Oloklerious, the central continent, is a diverse and unified land where various races, including orcs, dragon-men, dwarves, humans, half-elves, and a small number of elves and dark elves, live together in harmony. Its capital, "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Omou"}]},{"type":"text","value":", serves as the political and cultural hub, where representatives of all races gather for diplomacy and collaboration. Surrounding Omou are numerous towns and villages, each reflecting the unique heritage of its inhabitants, connected by trade routes and cultural exchange. Oloklerious stands as a testament to the possibility of peace and unity among diverse races."}]},{"type":"element","tag":"h4","props":{"id":"_1-capital-city"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"1. Capital City"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Omou"}]}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The capital of Oloklerious."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"A melting pot of cultures, where all races congregate for diplomacy, commerce, and celebration."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"The political and cultural heart of the continent."}]}]},{"type":"element","tag":"h4","props":{"id":"_2-inhabitants"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"2. Inhabitants"}]}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Orcs:"}]},{"type":"text","value":" One of the more populous races, contributing strength and resilience to the community."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Dragon-men:"}]},{"type":"text","value":" Descendants of dragons, known for their ancient lineage and wisdom."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Dwarves:"}]},{"type":"text","value":" Skilled craftsmen and miners, known for their engineering and mastery of the earth."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Humans:"}]},{"type":"text","value":" Adaptable and diverse, humans form a significant part of the population."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Half-elves:"}]},{"type":"text","value":" A blend of human and elven heritage, often acting as mediators between races."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Elves:"}]},{"type":"text","value":" A minority, known for their grace and longevity."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Dark Elves:"}]},{"type":"text","value":" Few in number, often mysterious and reclusive."}]}]},{"type":"element","tag":"h4","props":{"id":"_3-social-structure"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"3. Social Structure"}]}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Unity and Peace:"}]},{"type":"text","value":" The continent is founded on the principle of racial harmony and peaceful coexistence."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Cultural Exchange:"}]},{"type":"text","value":" Frequent intermingling of traditions, customs, and languages, creating a rich cultural tapestry."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Diplomatic Hub:"}]},{"type":"text","value":" Omou serves as the center for political negotiations and alliances among the races."}]}]},{"type":"element","tag":"h4","props":{"id":"_4-settlements"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"4. Settlements"}]}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Racial Towns and Villages:"}]},{"type":"text","value":" Each race has its own settlements around the continent, reflecting their heritage and connection to their native lands."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Trade Routes:"}]},{"type":"text","value":" A network of roads and trade routes link the various settlements to each other and to Omou."}]}]},{"type":"element","tag":"h4","props":{"id":"_5-geography"},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"5. Geography"}]}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Central Continent:"}]},{"type":"text","value":" Positioned as a central landmass, Oloklerious connects different racial homelands, serving as a neutral ground."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Natural Features:"}]},{"type":"text","value":" Diverse landscapes, ranging from mountains (home to the dwarves) to plains and forests (settled by humans, elves, and others)."}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:continents:1.oloklerious.md","_source":"content","_file":"continents/1.oloklerious.md","_stem":"continents/1.oloklerious","_extension":"md"}],"navigation":[{"title":"Home","_path":"/","layout":"default"},{"title":"Characters","_path":"/characters","children":[{"title":"Elves","_path":"/characters/elves","layout":"article"},{"title":"Dark Elves","_path":"/characters/dark-elves","layout":"article"},{"title":"Orcs","_path":"/characters/orcs","layout":"article"},{"title":"Dragons","_path":"/characters/dragons","layout":"article"},{"title":"Dwarves","_path":"/characters/dwarves","layout":"article"},{"title":"Humans","_path":"/characters/humans","layout":"article"}],"layout":"page"},{"title":"Continents","_path":"/continents","children":[{"title":"Oloklerious","_path":"/continents/oloklerious","layout":"article"}],"layout":"page"},{"title":"Contact","_path":"/contact","layout":"default"}]}